---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.MultiServerService
source: html/2e7c56fe-8550-d6b0-349c-2e574aee74f1.htm
---
# MultiServerService Methods

Registers a server with its service.